Wangzhongya123/NXPBLE_DEMO/bm/pin_mux.h
/*! *********************************************************************************
* Copyright 2013-2015, Freescale Semiconductor, Inc.
* Copyright 2016-2018 NXP
* All rights reserved.
*
* \file
*
* SPDX-License-Identifier: BSD-3-Clause
********************************************************************************** */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIOA24 (number 21), U21[24]/J5[20]/U22[7]/QN_PA24_TRACE_D0/SW1 */
#define BOARD_SW1_PERIPHERAL                                               GPIOA   /*!< Device name: GPIOA */
#define BOARD_SW1_SIGNAL                                                   GPIOA   /*!< GPIOA signal: GPIOA */
#define BOARD_SW1_CHANNEL                                                     24   /*!< GPIOA GPIOA channel: 24 */
#define BOARD_SW1_PIN_NAME                                               GPIOA24   /*!< Pin name */
#define BOARD_SW1_LABEL             "U21[24]/J5[20]/U22[7]/QN_PA24_TRACE_D0/SW1"   /*!< Label */
#define BOARD_SW1_NAME                                                     "SW1"   /*!< Identifier name */
#define BOARD_SW1_DIRECTION                              kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIOA19 (number 26), U21[29]/J5[14]/SW2 */
#define BOARD_SW2_PERIPHERAL                                               GPIOA   /*!< Device name: GPIOA */
#define BOARD_SW2_SIGNAL                                                   GPIOA   /*!< GPIOA signal: GPIOA */
#define BOARD_SW2_CHANNEL                                                     19   /*!< GPIOA GPIOA channel: 19 */
#define BOARD_SW2_PIN_NAME                                               GPIOA19   /*!< Pin name */
#define BOARD_SW2_LABEL                                     "U21[29]/J5[14]/SW2"   /*!< Label */
#define BOARD_SW2_NAME                                                     "SW2"   /*!< Identifier name */
#define BOARD_SW2_DIRECTION                              kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtons(void);

/* GPIOA31 (number 12), U21[17]/U26[2]/J8[8]/J7[20]/U3[12]/QN_PA31_TDO_SWO/LED */
#define BOARD_LED_RED_PERIPHERAL                                           GPIOA   /*!< Device name: GPIOA */
#define BOARD_LED_RED_SIGNAL                                               GPIOA   /*!< GPIOA signal: GPIOA */
#define BOARD_LED_RED_CHANNEL                                                 31   /*!< GPIOA GPIOA channel: 31 */
#define BOARD_LED_RED_PIN_NAME                                           GPIOA31   /*!< Pin name */
#define BOARD_LED_RED_LABEL "U21[17]/U26[2]/J8[8]/J7[20]/U3[12]/QN_PA31_TDO_SWO/LED" /*!< Label */
#define BOARD_LED_RED_NAME                                             "LED_RED"   /*!< Identifier name */
#define BOARD_LED_RED_DIRECTION                         kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIOA13 (number 32), U21[35]/U25[2]/J5[12]/QN_PA13_LED */
#define BOARD_LED_BLUE_PERIPHERAL                                          GPIOA   /*!< Device name: GPIOA */
#define BOARD_LED_BLUE_SIGNAL                                              GPIOA   /*!< GPIOA signal: GPIOA */
#define BOARD_LED_BLUE_CHANNEL                                                13   /*!< GPIOA GPIOA channel: 13 */
#define BOARD_LED_BLUE_PIN_NAME                                          GPIOA13   /*!< Pin name */
#define BOARD_LED_BLUE_LABEL                 "U21[35]/U25[2]/J5[12]/QN_PA13_LED"   /*!< Label */
#define BOARD_LED_BLUE_NAME                                           "LED_BLUE"   /*!< Identifier name */
#define BOARD_LED_BLUE_DIRECTION                        kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIOA25 (number 20), U21[23]/J7[12]/U22[6]/U25[5]/QN_PA25_TRACE_D1/LED */
#define BOARD_LED_GREEN_PERIPHERAL                                         GPIOA   /*!< Device name: GPIOA */
#define BOARD_LED_GREEN_SIGNAL                                             GPIOA   /*!< GPIOA signal: GPIOA */
#define BOARD_LED_GREEN_CHANNEL                                               25   /*!< GPIOA GPIOA channel: 25 */
#define BOARD_LED_GREEN_PIN_NAME                                         GPIOA25   /*!< Pin name */
#define BOARD_LED_GREEN_LABEL "U21[23]/J7[12]/U22[6]/U25[5]/QN_PA25_TRACE_D1/LED"  /*!< Label */
#define BOARD_LED_GREEN_NAME                                         "LED_GREEN"   /*!< Identifier name */
#define BOARD_LED_GREEN_DIRECTION                       kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

/* FC0_TXD (number 29), U21[32]/J7[13]/U7[5]/QN_PA16_U0_TXD */
#define BOARD_DEBUG_UART_TX_PERIPHERAL                                 FLEXCOMM0   /*!< Device name: FLEXCOMM0 */
#define BOARD_DEBUG_UART_TX_SIGNAL                                           TXD   /*!< FLEXCOMM0 signal: TXD */
#define BOARD_DEBUG_UART_TX_PIN_NAME                                     FC0_TXD   /*!< Pin name */
#define BOARD_DEBUG_UART_TX_LABEL          "U21[32]/J7[13]/U7[5]/QN_PA16_U0_TXD"   /*!< Label */
#define BOARD_DEBUG_UART_TX_NAME                                 "DEBUG_UART_TX"   /*!< Identifier name */

/* FC0_RXD (number 28), U21[31]/J7[15]/U7[4]/QN_PA17_U0_RXD */
#define BOARD_DEBUG_UART_RX_PERIPHERAL                                 FLEXCOMM0   /*!< Device name: FLEXCOMM0 */
#define BOARD_DEBUG_UART_RX_SIGNAL                                           RXD   /*!< FLEXCOMM0 signal: RXD */
#define BOARD_DEBUG_UART_RX_PIN_NAME                                     FC0_RXD   /*!< Pin name */
#define BOARD_DEBUG_UART_RX_LABEL          "U21[31]/J7[15]/U7[4]/QN_PA17_U0_RXD"   /*!< Label */
#define BOARD_DEBUG_UART_RX_NAME                                 "DEBUG_UART_RX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/* FC1_CTS_SDA (number 4), U21[8]/U16[3]/J5[3]/J8[10]/QN_PA07_SDA */
#define BOARD_PMOD_SDA_PERIPHERAL                                      FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_PMOD_SDA_SIGNAL                                            CTS_SDA   /*!< FLEXCOMM1 signal: CTS_SDA */
#define BOARD_PMOD_SDA_PIN_NAME                                      FC1_CTS_SDA   /*!< Pin name */
#define BOARD_PMOD_SDA_LABEL            "U21[8]/U16[3]/J5[3]/J8[10]/QN_PA07_SDA"   /*!< Label */
#define BOARD_PMOD_SDA_NAME                                           "PMOD_SDA"   /*!< Identifier name */

/* FC1_RTS_SCL (number 5), U21[9]/U16[2]/J5[1]/J8[9]/QN_PA06_SCL */
#define BOARD_PMOD_SCL_PERIPHERAL                                      FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_PMOD_SCL_SIGNAL                                            RTS_SCL   /*!< FLEXCOMM1 signal: RTS_SCL */
#define BOARD_PMOD_SCL_PIN_NAME                                      FC1_RTS_SCL   /*!< Pin name */
#define BOARD_PMOD_SCL_LABEL             "U21[9]/U16[2]/J5[1]/J8[9]/QN_PA06_SCL"   /*!< Label */
#define BOARD_PMOD_SCL_NAME                                           "PMOD_SCL"   /*!< Identifier name */

/* FC2_SCL_MISO (number 6), U21[10]/U15[2]/J5[11]/J8[3]/QN_PA05_MISO */
#define BOARD_PMOD_MISO_PERIPHERAL                                     FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_PMOD_MISO_SIGNAL                                          SCL_MISO   /*!< FLEXCOMM2 signal: SCL_MISO */
#define BOARD_PMOD_MISO_PIN_NAME                                    FC2_SCL_MISO   /*!< Pin name */
#define BOARD_PMOD_MISO_LABEL         "U21[10]/U15[2]/J5[11]/J8[3]/QN_PA05_MISO"   /*!< Label */
#define BOARD_PMOD_MISO_NAME                                         "PMOD_MISO"   /*!< Identifier name */

