Wangzhongya123/NXPBLE_DEMO/bm/pin_mux.h
/* ETM_TRACEDAT0 (number 21), U21[24]/J5[20]/U22[7]/QN_PA24_TRACE_D0/SW1 */
#define BOARD_ETM_TRACEDAT0_PERIPHERAL                                       ETM   /*!< Device name: ETM */
#define BOARD_ETM_TRACEDAT0_SIGNAL                                 ETM_TRACEDATA   /*!< ETM signal: ETM_TRACEDATA */
#define BOARD_ETM_TRACEDAT0_CHANNEL                                            0   /*!< ETM ETM_TRACEDATA channel: 0 */
#define BOARD_ETM_TRACEDAT0_PIN_NAME                               ETM_TRACEDAT0   /*!< Pin name */
#define BOARD_ETM_TRACEDAT0_LABEL   "U21[24]/J5[20]/U22[7]/QN_PA24_TRACE_D0/SW1"   /*!< Label */
#define BOARD_ETM_TRACEDAT0_NAME                                 "ETM_TRACEDAT0"   /*!< Identifier name */

/* ETM_TRACEDAT1 (number 20), U21[23]/J7[12]/U22[6]/U25[5]/QN_PA25_TRACE_D1/LED */
#define BOARD_ETM_TRACEDAT1_PERIPHERAL                                       ETM   /*!< Device name: ETM */
#define BOARD_ETM_TRACEDAT1_SIGNAL                                 ETM_TRACEDATA   /*!< ETM signal: ETM_TRACEDATA */
#define BOARD_ETM_TRACEDAT1_CHANNEL                                            1   /*!< ETM ETM_TRACEDATA channel: 1 */
#define BOARD_ETM_TRACEDAT1_PIN_NAME                               ETM_TRACEDAT1   /*!< Pin name */
#define BOARD_ETM_TRACEDAT1_LABEL "U21[23]/J7[12]/U22[6]/U25[5]/QN_PA25_TRACE_D1/LED" /*!< Label */
#define BOARD_ETM_TRACEDAT1_NAME                                 "ETM_TRACEDAT1"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitETM_TRACE(void);

/* USB_DM (number 18), U21[21]/J7[16]/J1[2]/QN_PA27_USB_DM */
#define BOARD_USB_DM_PERIPHERAL                                             USB0   /*!< Device name: USB0 */
#define BOARD_USB_DM_SIGNAL                                               USB_DM   /*!< USB0 signal: USB_DM */
#define BOARD_USB_DM_PIN_NAME                                             USB_DM   /*!< Pin name */
#define BOARD_USB_DM_LABEL                 "U21[21]/J7[16]/J1[2]/QN_PA27_USB_DM"   /*!< Label */
#define BOARD_USB_DM_NAME                                               "USB_DM"   /*!< Identifier name */

/* USB_DP (number 19), U21[22]/J[7]14/J1[3]/QN_PA26_USB_DP */
#define BOARD_USB_DP_PERIPHERAL                                             USB0   /*!< Device name: USB0 */
#define BOARD_USB_DP_SIGNAL                                               USB_DP   /*!< USB0 signal: USB_DP */
#define BOARD_USB_DP_PIN_NAME                                             USB_DP   /*!< Pin name */
#define BOARD_USB_DP_LABEL                 "U21[22]/J[7]14/J1[3]/QN_PA26_USB_DP"   /*!< Label */
#define BOARD_USB_DP_NAME                                               "USB_DP"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

/* FC1_RTS_SCL (number 5), U21[9]/U16[2]/J5[1]/J8[9]/QN_PA06_SCL */
#define BOARD_G_SENSOR_SCL_PERIPHERAL                                  FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_G_SENSOR_SCL_SIGNAL                                        RTS_SCL   /*!< FLEXCOMM1 signal: RTS_SCL */
#define BOARD_G_SENSOR_SCL_PIN_NAME                                  FC1_RTS_SCL   /*!< Pin name */
#define BOARD_G_SENSOR_SCL_LABEL         "U21[9]/U16[2]/J5[1]/J8[9]/QN_PA06_SCL"   /*!< Label */
#define BOARD_G_SENSOR_SCL_NAME                                   "G_SENSOR_SCL"   /*!< Identifier name */

/* FC1_CTS_SDA (number 4), U21[8]/U16[3]/J5[3]/J8[10]/QN_PA07_SDA */
#define BOARD_G_SENSOR_SDA_PERIPHERAL                                  FLEXCOMM1   /*!< Device name: FLEXCOMM1 */
#define BOARD_G_SENSOR_SDA_SIGNAL                                        CTS_SDA   /*!< FLEXCOMM1 signal: CTS_SDA */
#define BOARD_G_SENSOR_SDA_PIN_NAME                                  FC1_CTS_SDA   /*!< Pin name */
#define BOARD_G_SENSOR_SDA_LABEL        "U21[8]/U16[3]/J5[3]/J8[10]/QN_PA07_SDA"   /*!< Label */
#define BOARD_G_SENSOR_SDA_NAME                                   "G_SENSOR_SDA"   /*!< Identifier name */

/* GPIOA14 (number 31), U21[34]/U16[5]/J5[19]/QN_PA14_INT/G_INT */
#define BOARD_G_INT_PERIPHERAL                                             GPIOA   /*!< Device name: GPIOA */
#define BOARD_G_INT_SIGNAL                                                 GPIOA   /*!< GPIOA signal: GPIOA */
#define BOARD_G_INT_CHANNEL                                                   14   /*!< GPIOA GPIOA channel: 14 */
#define BOARD_G_INT_PIN_NAME                                             GPIOA14   /*!< Pin name */
#define BOARD_G_INT_LABEL              "U21[34]/U16[5]/J5[19]/QN_PA14_INT/G_INT"   /*!< Label */
#define BOARD_G_INT_NAME                                                 "G_INT"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitG_Sensor(void);

/* FC2_SDA_SSEL0 (number 8), U21[12]/U15[1]/J5[15]/J8[1]/QN_PA03_SSEL */
#define BOARD_SPI_FLASH_SSEL_PERIPHERAL                                FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_SPI_FLASH_SSEL_SIGNAL                                    SDA_SSEL0   /*!< FLEXCOMM2 signal: SDA_SSEL0 */
#define BOARD_SPI_FLASH_SSEL_PIN_NAME                              FC2_SDA_SSEL0   /*!< Pin name */
#define BOARD_SPI_FLASH_SSEL_LABEL    "U21[12]/U15[1]/J5[15]/J8[1]/QN_PA03_SSEL"   /*!< Label */
#define BOARD_SPI_FLASH_SSEL_NAME                               "SPI_FLASH_SSEL"   /*!< Identifier name */

/* FC2_SCL_MISO (number 6), U21[10]/U15[2]/J5[11]/J8[3]/QN_PA05_MISO */
#define BOARD_SPI_FLASH_MISO_PERIPHERAL                                FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_SPI_FLASH_MISO_SIGNAL                                     SCL_MISO   /*!< FLEXCOMM2 signal: SCL_MISO */
#define BOARD_SPI_FLASH_MISO_PIN_NAME                               FC2_SCL_MISO   /*!< Pin name */
#define BOARD_SPI_FLASH_MISO_LABEL    "U21[10]/U15[2]/J5[11]/J8[3]/QN_PA05_MISO"   /*!< Label */
#define BOARD_SPI_FLASH_MISO_NAME                               "SPI_FLASH_MISO"   /*!< Identifier name */

