Wangzhongya123/NXPBLE_DEMO/bm/pin_mux.h
/* FC2_SDA_MOSI (number 7), U21[11]/U15[5]/J5[13]/J8[2]/QN_PA04_MOSI */
#define BOARD_SPI_FLASH_MOSI_PERIPHERAL                                FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_SPI_FLASH_MOSI_SIGNAL                                     SDA_MOSI   /*!< FLEXCOMM2 signal: SDA_MOSI */
#define BOARD_SPI_FLASH_MOSI_PIN_NAME                               FC2_SDA_MOSI   /*!< Pin name */
#define BOARD_SPI_FLASH_MOSI_LABEL    "U21[11]/U15[5]/J5[13]/J8[2]/QN_PA04_MOSI"   /*!< Label */
#define BOARD_SPI_FLASH_MOSI_NAME                               "SPI_FLASH_MOSI"   /*!< Identifier name */

/* FC2_SCK (number 15), U21[18]/U15[6]/J5[9]/J8[4]/QN_PA30_TRACE_D3/SCK */
#define BOARD_SPI_FLASH_FC2_SCK_PERIPHERAL                             FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_SPI_FLASH_FC2_SCK_SIGNAL                                       SCK   /*!< FLEXCOMM2 signal: SCK */
#define BOARD_SPI_FLASH_FC2_SCK_PIN_NAME                                 FC2_SCK   /*!< Pin name */
#define BOARD_SPI_FLASH_FC2_SCK_LABEL "U21[18]/U15[6]/J5[9]/J8[4]/QN_PA30_TRACE_D3/SCK" /*!< Label */
#define BOARD_SPI_FLASH_FC2_SCK_NAME                         "SPI_FLASH_FC2_SCK"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI_FLASH(void);

/* FC2_SCK (number 16), U21[19]/J7[9]/U23[6]/QN_PA29_TRACE_D2/PWM7 */
#define BOARD_INITSPI_ETM_TRACEDAT2_PERIPHERAL                         FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_INITSPI_ETM_TRACEDAT2_SIGNAL                                   SCK   /*!< FLEXCOMM2 signal: SCK */
#define BOARD_INITSPI_ETM_TRACEDAT2_PIN_NAME                             FC2_SCK   /*!< Pin name */
#define BOARD_INITSPI_ETM_TRACEDAT2_LABEL "U21[19]/J7[9]/U23[6]/QN_PA29_TRACE_D2/PWM7" /*!< Label */
#define BOARD_INITSPI_ETM_TRACEDAT2_NAME                         "ETM_TRACEDAT2"   /*!< Identifier name */

/* FC2_SCL_MISO (number 18), U21[21]/J7[16]/J1[2]/QN_PA27_USB_DM */
#define BOARD_INITSPI_USB_DM_PERIPHERAL                                FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_INITSPI_USB_DM_SIGNAL                                     SCL_MISO   /*!< FLEXCOMM2 signal: SCL_MISO */
#define BOARD_INITSPI_USB_DM_PIN_NAME                               FC2_SCL_MISO   /*!< Pin name */
#define BOARD_INITSPI_USB_DM_LABEL         "U21[21]/J7[16]/J1[2]/QN_PA27_USB_DM"   /*!< Label */
#define BOARD_INITSPI_USB_DM_NAME                                       "USB_DM"   /*!< Identifier name */

/* FC2_SCL_SSEL1 (number 22), U21[25]/J5[18]/U5[4]/QN_PA23_TMS_SWDIO */
#define BOARD_INITSPI_SWDIO_PERIPHERAL                                 FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_INITSPI_SWDIO_SIGNAL                                     SCL_SSEL1   /*!< FLEXCOMM2 signal: SCL_SSEL1 */
#define BOARD_INITSPI_SWDIO_PIN_NAME                               FC2_SCL_SSEL1   /*!< Pin name */
#define BOARD_INITSPI_SWDIO_LABEL       "U21[25]/J5[18]/U5[4]/QN_PA23_TMS_SWDIO"   /*!< Label */
#define BOARD_INITSPI_SWDIO_NAME                                         "SWDIO"   /*!< Identifier name */

/* FC2_SDA_MOSI (number 19), U21[22]/J[7]14/J1[3]/QN_PA26_USB_DP */
#define BOARD_INITSPI_USB_DP_PERIPHERAL                                FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_INITSPI_USB_DP_SIGNAL                                     SDA_MOSI   /*!< FLEXCOMM2 signal: SDA_MOSI */
#define BOARD_INITSPI_USB_DP_PIN_NAME                               FC2_SDA_MOSI   /*!< Pin name */
#define BOARD_INITSPI_USB_DP_LABEL         "U21[22]/J[7]14/J1[3]/QN_PA26_USB_DP"   /*!< Label */
#define BOARD_INITSPI_USB_DP_NAME                                       "USB_DP"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
